# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
[
  [ "稚内", "道北", "011000" ],
  [ "旭川", "道北", "012010" ],
  [ "留萌", "道北", "012020" ],

  [ "網走", "道東", "013010" ],
  [ "北見", "道東", "013020" ],
  [ "紋別", "道東", "013030" ],
  [ "根室", "道東", "014010" ],
  [ "釧路", "道東", "014020" ],
  [ "帯広", "道東", "014030" ],

  [ "室蘭", "道南", "015010" ],
  [ "浦河", "道南", "015020" ],

  [ "札幌", "道央", "016010" ],
  [ "岩見沢", "道央", "016020" ],
  [ "倶知安", "道央", "016030" ],

  [ "函館", "道南", "017010" ],
  [ "江差", "道南", "017020" ],

  [ "青森", "青森県", "020010" ],
  [ "むつ", "青森県", "020020" ],
  [ "八戸", "青森県", "020030" ],

  [ "盛岡", "岩手県", "030010" ],
  [ "宮古", "岩手県", "030020" ],
  [ "大船渡", "岩手県", "030030" ],

  [ "仙台", "宮城県", "040010" ],
  [ "白石", "宮城県", "040020" ],

  [ "秋田", "秋田県", "050010" ],
  [ "横手", "秋田県", "050020" ],
        
  [ "山形", "山形県", "060010" ],
  [ "米沢", "山形県", "060020" ],
  [ "酒田", "山形県", "060030" ],
  [ "新庄", "山形県", "060040" ],

  [ "福島", "福島県", "070010" ],
  [ "小名浜", "福島県", "070020" ],
  [ "若松", "福島県", "070030" ],

  [ "水戸", "茨城県", "080010" ],
  [ "土浦", "茨城県", "080020" ],

  [ "宇都宮", "栃木県", "090010" ],
  [ "大田原", "栃木県", "090020" ],

  [ "前橋", "群馬県", "100010" ],
  [ "みなかみ", "群馬県", "100020" ],

  [ "さいたま", "埼玉県", "110010" ],
  [ "熊谷", "埼玉県", "110020" ],
  [ "秩父", "埼玉県", "110030" ],

  [ "千葉", "千葉県", "120010" ],
  [ "銚子", "千葉県", "120020" ],
  [ "館山", "千葉県", "120030" ],

  [ "東京", "東京都", "130010" ],
  [ "大島", "東京都", "130020" ],
  [ "八丈島", "東京都", "130030" ],
  [ "父島", "東京都", "130040" ],

  [ "横浜", "神奈川県", "140010" ],
  [ "小田原", "神奈川県", "140020" ],

  [ "新潟", "新潟県", "150010" ],
  [ "長岡", "新潟県", "150020" ],
  [ "高田", "新潟県", "150030" ],
  [ "相川", "新潟県", "150040" ],

  [ "富山", "富山県", "160010" ],
  [ "伏木", "富山県", "160020" ],

  [ "金沢", "石川県", "170010" ],
  [ "輪島", "石川県", "170020" ],

  [ "福井", "福井県", "180010" ],
  [ "敦賀", "福井県", "180020" ],

  [ "甲府", "山梨県", "190010" ],
  [ "河口湖", "山梨県", "190020" ],

  [ "長野", "長野県", "200010" ],
  [ "松本", "長野県", "200020" ],
  [ "飯田", "長野県", "200030" ],

  [ "岐阜", "岐阜県", "210010" ],
  [ "高山", "岐阜県", "210020" ],

  [ "静岡", "静岡県", "220010" ],
  [ "網代", "静岡県", "220020" ],
  [ "三島", "静岡県", "220030" ],
  [ "浜松", "静岡県", "220040" ],

  [ "名古屋", "愛知県", "230010" ],
  [ "豊橋", "愛知県", "230020" ],

  [ "津", "三重県", "240010" ],
  [ "尾鷲", "三重県", "240020" ],

  [ "大津", "滋賀県", "250010" ],
  [ "彦根", "滋賀県", "250020" ],

  [ "京都", "京都府", "260010" ],
  [ "舞鶴", "京都府", "260020" ],

  [ "大阪", "大阪府", "270000" ],

  [ "神戸", "兵庫県", "280010" ],
  [ "豊岡", "兵庫県", "280020" ],

  [ "奈良", "奈良県", "290010" ],
  [ "風屋", "奈良県", "290020" ],

  [ "和歌山", "和歌山県", "300010" ],
  [ "潮岬", "和歌山県", "300020" ],

  [ "鳥取", "鳥取県", "310010" ],
  [ "米子", "鳥取県", "310020" ],

  [ "松江", "島根県", "320010" ],
  [ "浜田", "島根県", "320020" ],
  [ "西郷", "島根県", "320030" ],

  [ "岡山", "岡山県", "330010" ],
  [ "津山", "岡山県", "330020" ],

  [ "広島", "広島県", "340010" ],
  [ "庄原", "広島県", "340020" ],

  [ "下関", "山口県", "350010" ],
  [ "山口", "山口県", "350020" ],
  [ "柳井", "山口県", "350030" ],
  [ "萩", "山口県", "350040" ],

  [ "徳島", "徳島県", "360010" ],
  [ "日和佐", "徳島県", "360020" ],

  [ "高松", "香川県", "370000" ],

  [ "松山", "愛媛県", "380010" ],
  [ "新居浜", "愛媛県", "380020" ],
  [ "宇和島", "愛媛県", "380030" ],

  [ "高知", "高知県", "390010" ],
  [ "室戸岬", "高知県", "390020" ],
  [ "清水", "高知県", "390030" ],

  [ "福岡", "福岡県", "400010" ],
  [ "八幡", "福岡県", "400020" ],
  [ "飯塚", "福岡県", "400030" ],
  [ "久留米", "福岡県", "400040" ],

  [ "佐賀", "佐賀県", "410010" ],
  [ "伊万里", "佐賀県", "410020" ],

  [ "長崎", "長崎県", "420010" ],
  [ "佐世保", "長崎県", "420020" ],
  [ "厳原", "長崎県", "420030" ],
  [ "福江", "長崎県", "420040" ],

  [ "熊本", "熊本県", "430010" ],
  [ "阿蘇乙姫", "熊本県", "430020" ],
  [ "牛深", "熊本県", "430030" ],
  [ "人吉", "熊本県", "430040" ],

  [ "大分", "大分県", "440010" ],
  [ "中津", "大分県", "440020" ],
  [ "日田", "大分県", "440030" ],
  [ "佐伯", "大分県", "440040" ],

  [ "宮崎", "宮崎県", "450010" ],
  [ "延岡", "宮崎県", "450020" ],
  [ "都城", "宮崎県", "450030" ],
  [ "高千穂", "宮崎県", "450040" ],

  [ "鹿児島", "鹿児島県", "460010" ],
  [ "鹿屋", "鹿児島県", "460020" ],
  [ "種子島", "鹿児島県", "460030" ],
  [ "名瀬", "鹿児島県", "460040" ],

  [ "那覇", "沖縄県", "471010" ],
  [ "名護", "沖縄県", "471020" ],
  [ "久米島", "沖縄県", "471030" ],
  [ "南大東", "沖縄県", "472000" ],
  [ "宮古島", "沖縄県", "473000" ],
  [ "石垣島", "沖縄県", "474010" ],
  [ "与那国島", "沖縄県", "474020" ],
].each do | city_name, prefecture_name, city_code |
  Location.create!(
    { city_name: city_name, prefecture_name: prefecture_name, city_code: city_code }
  )
end
